# NoViewSpecificSiteImports Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteImportFailures..::..NoViewSpecificSiteImports Property
BuiltInFailures..::..SiteImportFailures Class See Also
---
Can't make Toposurface from View Specific Imports.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoViewSpecificSiteImports { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoViewSpecificSiteImports As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoViewSpecificSiteImports {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteImportFailures Class
Autodesk.Revit.DB Namespace